# Pandas DataFrame

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [6]:
import pandas as pd

# READ_CSV Files :-
(comma seprated file)  it is a simple way to store the big and bigest data sets.
csv file contains plain text.

# File loding

x = pd.read_csv("C:\dowanlode\data.csv")

* Error ---> UnicodeescapeError

       \ ---> \\
* '' and "" --> code not 
      pd.read_csv/excel(r"a\d\data.excel")

In [7]:
import pandas as pd

In [8]:
data = pd.read_csv("C:\Users\lenovo\Desktop\Downloads\data\bank_client_information.csv")
#  error --> SyntaxError: unicodeesape

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (3397359196.py, line 1)

In [10]:
data = pd.read_csv("C:\\Users\\lenovo\\Desktop\\Downloads\\Data\\bank_client_information.csv")

In [12]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [154]:
# loading the csv into a dataframe with to_string
data.to_string()

'  First Name Last Name                    Email Postal Code  Net Worth  Years with Bank\n0      Bird      Steve           bird@gmail.com     N94 3M0    5000.00                5\n1       Noah     Small       nsmall@hotmail.com     N8S 14K   10000.00                6\n2       Nina    Keller          azikez@gahew.mr     S1T 4E6    9072.02                7\n3    Chanel      Steve         chanel@gmail.com     N7T 3E6   11072.02               10\n4       Kate      Noor         kate@hotmail.com     K8N 5H6    5000.00               22\n5      Samer        Mo          samer@gmail.com     J7H 3HY  100000.00               26\n6       Heba    Ismail  heba.ismail@hotmail.com     K8Y 3M8   50000.00               11\n7      Laila     Ahmed      Laila.a@hotmail.com     J8Y 3M0   20000.00                3\n8     Joseph    Patton           daafeja@boh.jm     M6U 5U7    2629.13                1\n9       Noah     Moran        guutodi@bigwoc.kw     K2D 4M9    8626.96               13'

In [155]:
# loading the csv into a dataframe without to_string
data

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [156]:
# max_rows : you can check your system's maximum row with:
print(pd.options.display.max_rows)

60

# Set and Reset the Index

In [13]:
# data
x = {'name':['python','kafka','java','react'],
     'age':[23,24,25,44]
     }
x = pd.DataFrame(x)
print(x)

     name  age
0  python   23
1   kafka   24
2    java   25
3   react   44

In [15]:
# age as a index
x.set_index('age')
x            # index

     name  age
0  python   23
1   kafka   24
2    java   25
3   react   44

In [16]:
#  Inplace = True # parmanent change
x.set_index('age',inplace=True) 
x

       name
age
23   python
24    kafka
25     java
44    react

In [20]:
x.set_index('name',inplace=True)

In [21]:
x

        age
name
python   23
kafka    24
java     25
react    44

In [22]:
# Reset Index
x.reset_index(inplace=True)

In [23]:
x

     name  age
0  python   23
1   kafka   24
2    java   25
3   react   44

In [76]:
x1 = {'name':['python','kafka','java','react'],
     'age':[23,24,25,44],
     'course name':['DA','DS','ML','CLOUD']
     }
x1 = pd.DataFrame(x1)
print(x1)

     name  age course name
0  python   23          DA
1   kafka   24          DS
2    java   25          ML
3   react   44       CLOUD

# how to excess Single Columns or Multipal Columns in DataFrame

  # 1.how to excess single column --> . method
  # 2.methods to excess the single column ---> [ ] method

In [77]:
# 1st method
x1.name

0    python
1     kafka
2      java
3     react
Name: name, dtype: object

In [78]:
# 2nd method
x['name']

0    python
1     kafka
2      java
3     react
Name: name, dtype: object

In [80]:
#  . method 
x1.course name  # error : space not taking . method

SyntaxError: invalid syntax (1290681721.py, line 2)

In [81]:
# [] method
x1['course name']

0       DA
1       DS
2       ML
3    CLOUD
Name: course name, dtype: object

# how to excess multipal columns in DataFrame

In [33]:
# # fetch multipal column

# x1['name','age']  # single bracket 

# # Error -->  KeyError: ('name', 'age')

In [82]:
x1[['name','age']] # 2d DataFrame

     name  age
0  python   23
1   kafka   24
2    java   25
3   react   44

In [83]:
x1[['name','age','course name']]

     name  age course name
0  python   23          DA
1   kafka   24          DS
2    java   25          ML
3   react   44       CLOUD

# how to change name (RENAME) of the column?

In [84]:
# how to change name of the column?
# course name --> courses
x1

     name  age course name
0  python   23          DA
1   kafka   24          DS
2    java   25          ML
3   react   44       CLOUD

In [85]:
x1.rename(
    columns = { 'course name' : 'Courses'}, inplace = True
)

In [86]:
x1   # name change

     name  age Courses
0  python   23      DA
1   kafka   24      DS
2    java   25      ML
3   react   44   CLOUD

In [125]:
x1.rename(
    columns = 
    {'name' : 'Subject_Name','age' : 'Age' , ' Courses' : 'Courses_Name'}, 
      inplace =True)

In [126]:
x1

  Subject_Name   Age Courses
0       python    23      DA
1        kafka    24      DS
2         java    25      ML
3        react    44   CLOUD

# Indexing in DataFrame

In [127]:
# INDEXING --->
# x1[0]
# x1[[0]]

In [128]:
x1[0:3] # slicing

  Subject_Name   Age Courses
0       python    23      DA
1        kafka    24      DS
2         java    25      ML

In [104]:
x1['Subject_Name'][0]

'python'

In [105]:
x1['Subject_Name'][2]

'java'

In [106]:
x1['Subject_Name']

0    python
1     kafka
2      java
3     react
Name: Subject_Name, dtype: object

In [107]:
x1['Subject_Name'][0:3]

0    python
1     kafka
2      java
Name: Subject_Name, dtype: object

In [108]:
x1

  Subject_Name   Age Courses
0       python    23      DA
1        kafka    24      DS
2         java    25      ML
3        react    44   CLOUD

In [139]:
x1[' Age'][2]=30

C:\Users\lenovo\AppData\Local\Temp\ipykernel_4336\2513219535.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x1[' Age'][2]=30

In [151]:
x1['Subject_Name'][1] = 'HTML'

C:\Users\lenovo\AppData\Local\Temp\ipykernel_4336\2591861546.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x1['Subject_Name'][1] = 'HTML'

In [152]:
x1

  Subject_Name   Age Courses
0       python    23      DA
1         HTML    24      DS
2         java    30      ML
3        react    44   CLOUD